/* クイズの問題データを管理 */
export const quizData = [
    // 1
    {
        question: "「千と千尋の神隠し」で、千尋が働くことになった湯屋の名前は？",
        choice: ["油屋", "銭屋", "薬屋", "神屋"],
        correctAnswer: "油屋"
    },
    // 2
    {
        question: "「ハウルの動く城」で、ハウルの城の動力源となっている火の悪魔の名前は？",
        choices: ["マルクル", "ヒン", "カブ", "カルシファー"],
        correctAnswer: "カルシファー"
    },
    // 3
    {
        question: "「風の谷のナウシカ」で、腐海の森に生息する巨大な蟲の王様は？",
        choices: ["ヘビケラ", "王蟲", "ウシアブ", "ユパ"],
        correctAnswer: "王蟲"
    },
    // 4
    {
        question: "スタジオジブリ作品の多くで音楽を担当している作曲家は誰？",
        choices: ["坂本龍一", "久石譲", "菅野よう子", "冨田勲"],
        correctAnswer: "久石譲"
    },
    // 5
    {
        question: "「耳をすませば」で、主人公の月島雫が物語を書くきっかけとなった、猫の人形（男爵）の名前は？",
        choices: ["ムタ", "バロン", "ルナルド", "トト"],
        correctAnswer: "バロン"
    },
    // 6
    {
        question: "「千と千尋の神隠し」で、千尋が両親らしき豚を見つけるために挑戦した試練で、用意された豚の数は何頭でしたか？",
        choices: ["6頭", "10頭", "12頭", "20頭"],
        correctAnswer: "20頭"
    },
    // 7
    {
        question: "「天空の城ラピュタ」で、ドーラ一家が所有する飛行船の名前は何ですか？",
        choices: ["タイガーモス号", "ゴリアテ", "ノア", "インデバー"],
        correctAnswer: "タイガーモス号"
    },
    // 8
    {
        question: "「もののけ姫」で、アシタカが旅立つ原因となったタタリ神は何に侵されたものだったでしょう？",
        choices: ["鉄", "憎しみ", "毒", "病"],
        correctAnswer: "憎しみ"
    },
    // 9
    {
        question: "「魔女の宅急便」で、キキが最初に空を飛んだ時に一緒にいたのは誰ですか？",
        choices: ["おソノさん", "ジジ", "トンボ", "ウルスラ"],
        correctAnswer: "ジジ"
    },
    // 10
];